[
  {
    "title": "React Native Developer",
    "company": "Platform Builders · Full-time",
    "companyLink": "https://www.linkedin.com/company/5082784/",
    "description": "Trabalhei como desenvolvedor Front-end React, React Native e no Back-end com Node.js para correções mais pontuais no BFF. \n\nDesenvolvi funcionalidades e correções no app da RD (https://play.google.com/store/apps/details?id=br.com.drogaraia&hl=pt_BR) e Grupo DPSP (https://www.grupodpsp.com.br/) e desenvolvendo o sistema de frente de caixa das farmácias RD.\n\nUsei as seguintes tecnologias e bibliotecas no meu dia a dia: HTML, CSS, Javascript, Typescript, React, React native, Node.js, GraphQL(Apollo Client), Next.js(SSR), Styled components, Tailwind e Testes unitários(Jest/RTL) e Micro frontend.\n\nTambém trabalhei com metodologias ágeis dentro do time. A que foi usada nessa experiência foi o Scrum com auxílio da ferramenta Jira.",
    "date": "Aug 2023 - Feb 2025"
  },
  {
    "title": "React Developer",
    "company": "DBC Company · Full-time",
    "companyLink": "https://www.linkedin.com/company/398921/",
    "description": "Trabalhei como desenvolvedor Front-end usando React como principal biblioteca.\n\nDesenvolvi e mantive o sistema da ouvidoria da coperativa financeira Sicredi (https://www.sicredi.com.br/home/) usando as seguintes tecnologias e bibliotecas: HTML5, CSS3, Javascript, Typescript, React, Zustand, Testes unitários(Jest), Styled Components, Tailwind, Strapi.\n\nTambém trabalhei com metodologias ágeis dentro da squad. A que foi usada nessa experiência foi uma junção de Kanban com Scrum, mais conhecido com SrumBan.",
    "date": "Jun 2022 - Aug 2023"
  },
  {
    "title": "React Developer",
    "company": "Grupo FCamara · Full-time",
    "companyLink": "https://www.linkedin.com/company/738478/",
    "description": "Fui desenvolvedor Front-end usando o React como biblioteca principal.\n\nTrabalhei desenvolvendo, mantendo, corrigido e propondo soluções nos sitemas de e-commerce da drogaraia (https://www.drogaraia.com.br/) e drogasil (https://www.drogasil.com.br/), usando as seguintes tecnologias e bibliotecas: HTML, CSS, Javascript, Typescript, React, React Native, GraphQL(Apollo\nClient), Next.js(SSR), Styled components e Testes unitários(Jest/RTL).\n\nTambém foi muito usado por mim e pela minha squad a metodologia Kanban para gerenciamento de tarefas e prazos.",
    "date": "Jan 2021 - May 2022"
  },
  {
    "title": "Desenvolvedor de front-end",
    "company": "Diebold Nixdorf Software",
    "companyLink": "https://www.linkedin.com/company/4458/",
    "description": "Trabalhei como desenvolvedor Front end usando o React no sistema interno de caixa da coperativa financeira Sicredi(https://www.sicredi.com.br/home/).\n\nPara entregar o trabalho, eu fiz o uso das tecnologias HTML, CSS, Bootstrap, Javascript, Typescript, React, Web components e jQuery(no legado), fora as metodologias ágeis que usava um misto de Kanban com Scrum, prevalecendo a maioria dos aspectos do Kanban.",
    "date": "Mar 2020 - Jan 2021"
  },
  {
    "title": "Desenvolvedor de front-end",
    "company": "TOTVS IBIRAPUERA / 2bdigital · Full-time",
    "companyLink": "https://www.linkedin.com/company/9217499/",
    "description": "Trabalhei como desenvolvedor Front-end React focando em sistemas de e-commerce.\n\nEm um dos projetos(https://voltzmotors.com/), eu fiz uso de HTML, CSS, JavaScript, React, jQuery(para o legado), Sass, Less, Vtex(pra o e-commerce). Para outros projetos, foi usado uma stack de tecnologias parecida.\n\nDentre as metodologias ágeis aplicadas na empresa, a mais predominante era o Kanban, mas isso dependia do projeto em questão.",
    "date": "Oct 2018 - Jan 2020"
  },
  {
    "title": "Freelancer Desenvolvedor web front end",
    "company": "Upwork",
    "companyLink": "https://www.linkedin.com/company/4827017/",
    "description": "Trabalhei como desenvolvedor Frontend React freelancer mas também com foco em outras tecnologias.\n\nTrabalhei em diversos projetos pequenos dentro da plataforma Upwork. Foi onde comecei a obter experiência de mercado. Usei diversas tecnologias e skills, entre elas: HTML5, CSS3, Javascript, Typescript, React, Gatsby, Next.js Redux, TDD, Jest, jQuery, Sass, Less, Wordpress, Woocommerce, Strapi, Vtex, Node.js.\n\nUm dos projetos desenvolvidos: https://www.sharktankhub.com/",
    "date": "May 2016 - Oct 2019"
  },
  {
    "title": "Desenvolvedor web front end",
    "company": "NSH Technologies",
    "companyLink": "https://www.linkedin.com/company/11312394/",
    "description": "Trabalhei como desenvolvedor Front end no projeto https://www.wine.com.br/, integrando a plataforma de e-commerce Oracle Cloud\nCommerce. Nesse projeto usei as seguintes tecnologias: HTML, CSS, JavaScript, jQuery, Sass, Less, WordPress, OCC(Oracle Cloud\nCommerce), HandleBars.",
    "date": "Jun 2017 - Oct 2018"
  },
  {
    "title": "Desenvolvedor web front end",
    "company": "Double",
    "companyLink": "https://www.linkedin.com/search/results/all/?keywords=Double",
    "description": "Trabalhei como desenvolvedor web com foco em Wordpress. Das tecnologias usadas incluem: HTML5, CSS3, Javascript, jQuery, Sass, Less, Wordpress. Um dos projetos desenvolvidos foi http://leisecasalvavidas.com.br/",
    "date": "Mar 2017 - Jan 2018"
  }
]
